{
  "greeting": "Hello",
  "text": "Thank you for visiting our website.",
  "name": "Katie Yang",
  "language": "Language",
  "LandingPage": {
    "message": "",
    "actionables": {
      "message": "Which side of me do you want to explore?",
      "Frontend": "Front-end",
      "Design": "UI/UX"
    }
  },
  "HeaderContent": {
    "ProjectType": "Project Type",
    "MyRole": "My Role",
    "CurrentStatus": "Current Status"
  },
  "ZOOX": {
    "HeaderContent": {
      "title": "ZOOX Autonomous Vehicle In Car Display",
      "detail": "The display is Macbook Pro 14-inch in size and is located on the side of the seat. Created mood boards and 24 high-fidelity pages. Wireframed and prototyped with animations and transitions. Created lock screen design to prevent accidental interactions because of the physical placement of the display. Designed a full set of safety instructions and protocols, including declaring emergencies and video chat with staff.",
      "projectType": "Hypothetical Class Project",
      "myRole": "Project Owner",
      "currentStatus": "Design phase done",
      "Btn": false,
      "BtnContent": null,
      "IconImage": {
        "images": "../../pic/InCar.png",
        "name": "In car display location"
      }
    },
    "DesignOverview": {
      "title": "Design Overview",
      "detail": "View Prototype in Browser"
    },
    "FunctionalRequirements": {
      "title": "Need Analysis",
      "analysis": {
        "first": {
          "cause": "Passengers' safety is paramount, and ZOOX as a start-up company must take strict precautions for their reputation",
          "solution": "Measures to ensure the safety of passengers and how to deal with them after an incident is required."
        },
        "second": {
          "cause": "ZOOX is a provider of novel technologies and products",
          "solution": "Showcase the technology involved and how the vehicle works"
        },
        "third": {
          "cause": "ZOOX is currently positioned as a driverless taxi service provider",
          "solution": "It needs to have the usual features of taxi services, such as changing destinations"
        },
        "fourth": {
          "cause": "As a fully autonomous vehicle, ZOOX do not have the control panel and steering wheel of ordinary cars",
          "solution": "Require ways to adjust interior environment settings, such as internal temperature"
        },
        "fifth": {
          "cause": "Passengers' attention does not need to be on the road",
          "solution": "Entertainment can be provided to enhance the experience, such as in-car music player"
        },
        "sixth": {
          "cause": "The screen is located at the side of passenger's seat, so it may be touched by mistake",
          "solution": "Requires mechanism to prevent accidental changes"
        }
      }
    },
    "InitialFeature": {
      "title": "Initial functional requirements checklist",
      "list": {
        "safety": {
          "title": "Safety",
          "content": {
            "detail1": "Pre-ride safety instructions",
            "detail2": "Declare emergencies, video call with safety advisor"
          }
        },
        "status": {
          "title": "Showcase ZOOX status",
          "content": {
            "detail1": "Showcase what is detected by Computer Vision",
            "detail2": "Showcase how the road is like from the vehicle's perspective"
          }
        },
        "ride": {
          "title": "Ride related functionalities",
          "content": {
            "detail1": "Current location and time remaining",
            "detail2": "Authenticate passenger, change destination, and cancel trip"
          }
        },
        "control": {
          "title": "In-car environment controls",
          "content": {
            "detail1": "Adjust temperature and seating"
          }
        },
        "entertainment": {
          "title": "Entertainment",
          "detail1": "Music"
        },
        "PreventAccidents": {
          "title": "Prevent accidental changes",
          "detail1": "Lockscreen"
        }
      }
    },
    "FunctionChecklist": {
      "title": "Deepen the requirements",
      "analysis": {
        "first": {
          "cause": "行程开始前的安全说明",
          "solution": "和乘客解释必要的安全功能，如何开启车门，ZOOX的设计巧思如何保证乘客安全等"
        },
        "second": {
          "cause": "紧急情况报告",
          "solution": "紧急情况下没有太多时间打字，需要有提前设定的模版，提供最可能出现的紧急情况的文字"
        },
        "third": {
          "cause": "工作人员视频连线",
          "solution": "可能连上了但是没有声音，或者乘客无法无法用声音沟通，也需要有提前设定的模版"
        },
        "fourth": {
          "cause": "乘客需要看当前位置，并且好奇从车辆的角度看当前路段时什么样子的",
          "solution": "在地图、车视角来回切换"
        },
        "fifth": {
          "cause": "音乐播放、车内环境调节可能不会经常用到",
          "solution": "可拉出的功能页面"
        },
        "sixth": {
          "cause": "座位为全包座位，屏幕在乘客身侧，可能会误触",
          "solution": "一段时间乘客没有操作之后会开启屏保。屏保上可显示基础信息，如旅程还剩多长时间、车速"
        }
      }
    },
    "Moodboard": {
      "title": "Moodboard",
      "detail": "在下面两种情绪板中，最后选择了情绪板2。 其风格特征更与ZOOX先进官网相近，并且与友商的设计风格产生对比，更有识别性。",
      "description1": "Moodboard 1. Light mode design that gives out a smart soft technology feeling as well as elegance with the bright and clean visual design. Mostly uses pastel colors to work as contrast to the background to aid information display.",
      "description2": "Moodboard 2. Dark mode design that gives out a serious futuristic, technological ambiance. High saturation colors are used as contrast to the background to put emphasis on the displayed information."
    },
    "Wireframes": {
      "title": "Wireframes"
    },
    "Prototypes": {
      "title": "Prototypes"
    },
    "Iteration": {
      "title": "Iteration",
      "changes": {
        "title": "Changes: ",
        "description": {
          "text1": "Changed screensaver unlocking mechanism from swiping from right to left to from bottom to top, which is more in line with the motion of unlocking mobile phones or tablets. Removing the arrow also saves left and right spaces. ",
          "text2": "Simplified the information displayed on the screensaver, making it cleaner",
          "text3": "Changed the orientation of the expandable page from horizontal to vertical, making the pull-out animation more concise and intuitive",
          "text4": "Instead of swiping the page sideways to switch between the map and the car's view, one can press the toggle button. Other than requiring a smaller range of motion, it allows the passenger to have a better idea about what the other option is."
        }
      },
      "FinalResult": {
        "title": "Final Result:",
        "detail": "View Prototype in Browser"
      }
    }
  },
  "WhatColor": {
    "HeaderContent": {
      "title": "What Color: an Arduino based color detection toy",
      "detail": "This product encourages 4+ year olds to learn about colors with surrounding objects. After the color is detected by the sensor, its red, yellow and blue composition will be displayed on WhatColor's touchscreen, and the child can then draw with this color. Showing the RGB composition not only can teach children what red, yellow, and blue are, but also color mixing and more advanced color concepts such as coral and cyan for those that already know RGB.",
      "projectType": "Class Project",
      "myRole": "Project Owner",
      "currentStatus": "User testing done",
      "Btn": false,
      "BtnContent": null,
      "IconImage": null
    },
    "Intro": {
      "title": "Introduction",
      "message": "According to CDC, children at the age of 4 should reach the cognitive milestone of being able to name a few colors of items",
      "detail1": "What Color受众：正在学习基础颜色（红，黄，蓝），或已经学过基础颜色，想要学习进阶颜色或色彩混合的四岁+小孩",
      "detail2": "鼓励小孩在探索的时候去识别物体颜色，并用这个颜色进行绘画",
      "detail3": "提升孩子对颜色组成的敏感度，接触色彩混合理论",
      "detail4": "组成部分：颜色传感器 + 触摸屏 + Arduino + 3D打印外壳",
      "compo": "3D printed shell"
    },
    "InitDesign": {
      "title": "Initial Design Progress",
      "need": {
        "title": "Need analysis: ",
        "message": "4 year olds should be able to name a few colors of items."
      },
      "task": {
        "title": "Task analysis: ",
        "message1": "Found toy with similar concept: magnetic drawing board. Performed task analysis with an online ",
        "message2": "video",
        "message3": " with children interacting and reviewing a board."
      },
      "discovery": {
        "title": "Main takeaways: ",
        "message1": "3 year-old child could lift a 710g item",
        "message2": "pen with a diameter of 1.2cm could be easily utilized by 1 year- old in a grabbing hand position"
      }
    },
    "IteratedDesign": {
      "title": "Iterated Design",
      "summary": {
        "detail1": "考虑了人体工程学设计，结合了市场上常有的功能，使其便于携带",
        "detail2": "考虑到大部分儿童都用右手书写，把手被放在了左侧，这样他们可以持设备和笔跑来跑去",
        "detail3": "增加了触摸屏和笔，用孩子绘画的天性增加娱乐感",
        "detail4": "相近于儿童可能已经熟悉的平板和磁力绘画板"
      },
      "FlowChart": "Workflow Chart",
      "thoughts": {
        "detail1": "Then thought about how putting the color sensor on the back of the product fits more closely with people's habit of scnaning objects with our phones or tablets.",
        "detail2": "This change is reflected in 3D modeling."
      },
      "modeling": {
        "title": "3D Modeling",
        "message1": "The 9V battery is placed at the bottom of the product, so the balance point of this device would be more towards the bottom. This make it easier for children to hold and run around with it while avoiding affordance of smashing ",
        "message2": "According to Kong, the optimal handle diameter for grip force tasks is 19.7% of the user's hand length. Therefore, the best diameter for a 4 year-old with hand length of 10 cm would be 1.97 cm",
        "message3": "Made sure shell thickness at any point is at least 1.2 cm"
      }
    },
    "FinalProduct": {
      "title": "Final Product + Usability Testing",
      "summary": {
        "detail1": "The product's name is written at the top of the toy to indicate which orientation this device should be held",
        "detail2": "The device weighs about 300g, which wouldn't cause musculoskeletal injury among young children",
        "detail3": {
          "title": "Conducted usability testing with a 4 year old female and a 8 year old female. To protect their privacy, videos wouldn't be shared.",
          "detail1": "All of the participants took the pen out by poking at its top, rather than using the space at the right-side of the pen.",
          "detail2": "The handle is placed on the left so it wouldn't hinge most child's writing (because right-handedness is the most common), but younger child seems to like grabbing it with their right hand, which could reverse the orientation."
        }
      },
      "FlowChart": "Updated Workflow Chart"
    },
    "FutureWork": {
      "title": "Future Work",
      "summary": {
        "detail1": "此原型设计受到硬件可实施性影响，因而有很多进步空间。基于此次的用户测试可以进行下一步的迭代设计。",
        "detail2": "迭代设计仅考虑在有工业标准化的硬件时，该如何设计。",
        "detail3": "可考虑的路如：双手持平板式，单手扫描设备，孩子用智能手表拓展设备/软件...",
        "detail4": "基于Improving Colour Patterns to Assist People with Colour Vision Deficiency论文，在显示的颜色上加入图案，也可以帮助色盲儿童尝试理解颜色概念，与生活中物品的颜色"
      }
    },
    "References": "References"
  },
  "Jarney": {
    "HeaderContent": {
      "title": "JARney Scheduler Page Redesign",
      "detail": "此产品鼓励4岁+的孩子通过寻找物品来学习颜色。在识别一个物品的颜色后，What Color的触摸屏上会显示此颜色的红黄蓝构成，然后孩子可以用这个颜色进行绘画。显示红黄蓝的构成不仅可以教孩子什么是红色、黄色、蓝色，而且对于已经熟知红黄蓝的孩子，可以教他们颜色混合和更进阶的颜色概念，如珊瑚色、青色。",
      "projectType": "Class Project",
      "myRole": "Project Owner",
      "currentStatus": "User testing done",
      "Btn": false,
      "BtnContent": null,
      "IconImage": null
    }
  },
  "ActivityStatus": {
    "HeaderContent": {
      "title": "Activity Status Study",
      "detail": "",
      "projectType": "Class Project",
      "myRole": "",
      "currentStatus": "",
      "Btn": false,
      "BtnContent": null,
      "IconImage": null
    }
  }
}
