{
  "greeting": "Hello",
  "text": "Thank you for visiting our website.",
  "name": "Katie Yang",
  "language": "Language",
  "LandingPage": {
    "message": "",
    "actionables": {
      "message": "Which side of me do you want to explore?",
      "Frontend": "Software Engineering",
      "Design": "UI/UX"
    },
    "Intro": {
      "header1": "Hi!",
      "header2": "I am Katie Yang",
      "slogan": "I am a Software Developer first and UI/UX Designer second",
      "message1": "My passion: improve people's quality of life by standing at the intersection of technology and human-centered design.",
      "message2": "During my free-time, I am into watching anime, learn about interactive art, and watch/perform stand-up comedy."
    }
  },
  "HeaderContent": {
    "ProjectType": "Project Type",
    "MyRole": "My Role",
    "CurrentStatus": "Current Status"
  },
  "ZOOX": {
    "HeaderContent": {
      "title": "ZOOX Autonomous Vehicle In Car Display",
      "detail": "The display is Macbook Pro 14-inch in size and is located on the side of the seat. Created mood boards and 24 high-fidelity pages. Wireframed and prototyped with animations and transitions. Created lock screen design to prevent accidental interactions because of the physical placement of the display. Designed a full set of safety instructions and protocols, including declaring emergencies and video chat with staff.",
      "projectType": "Hypothetical Class Project",
      "myRole": "Project Owner",
      "currentStatus": "Design phase done",
      "Btn": false,
      "BtnContent": null,
      "IconImage": {
        "images": "../../pic/InCar.png",
        "name": "In car display location"
      }
    },
    "DesignOverview": {
      "title": "Design Overview",
      "detail": "View Prototype in Browser"
    },
    "FunctionalRequirements": {
      "title": "Need Analysis",
      "analysis": {
        "first": {
          "cause": "Passengers' safety is paramount, and ZOOX as a start-up company must take strict precautions for their reputation",
          "solution": "Measures to ensure the safety of passengers and how to deal with them after an incident is required."
        },
        "second": {
          "cause": "ZOOX is a provider of novel technologies and products",
          "solution": "Showcase the technology involved and how the vehicle works"
        },
        "third": {
          "cause": "ZOOX is currently positioned as a driverless taxi service provider",
          "solution": "It needs to have the usual features of taxi services, such as changing destinations"
        },
        "fourth": {
          "cause": "As a fully autonomous vehicle, ZOOX do not have the control panel and steering wheel of ordinary cars",
          "solution": "Require ways to adjust interior environment settings, such as internal temperature"
        },
        "fifth": {
          "cause": "Passengers' attention does not need to be on the road",
          "solution": "Entertainment can be provided to enhance the experience, such as in-car music player"
        },
        "sixth": {
          "cause": "The screen is located at the side of passenger's seat, so it may be touched by mistake",
          "solution": "Requires mechanism to prevent accidental changes"
        }
      }
    },
    "InitialFeature": {
      "title": "Initial functional requirements checklist",
      "list": {
        "safety": {
          "title": "Safety",
          "content": {
            "detail1": "Pre-ride safety instructions",
            "detail2": "Declare emergencies, video call with safety advisor"
          }
        },
        "status": {
          "title": "Showcase ZOOX status",
          "content": {
            "detail1": "Showcase what is detected by Computer Vision",
            "detail2": "Showcase how the road is like from the vehicle's perspective"
          }
        },
        "ride": {
          "title": "Ride related functionalities",
          "content": {
            "detail1": "Current location and time remaining",
            "detail2": "Authenticate passenger, change destination, and cancel trip"
          }
        },
        "control": {
          "title": "In-car environment controls",
          "content": {
            "detail1": "Adjust temperature and seating"
          }
        },
        "entertainment": {
          "title": "Entertainment",
          "detail1": "Music"
        },
        "PreventAccidents": {
          "title": "Prevent accidental changes",
          "detail1": "Lockscreen"
        }
      }
    },
    "FunctionChecklist": {
      "title": "Deepen the requirements",
      "analysis": {
        "first": {
          "cause": "The seat wraps around and is beside the passenger's shoulder, so there might be accidental touches",
          "solution": "After a period of idleness, a lock screen would appear with basic information like time left till destination and car speed"
        },
        "second": {
          "cause": "Pre-ride safety instructions",
          "solution": "Explain the safety functionalities, how to open the doors, and ways ZOOX ensure ride safety"
        },
        "third": {
          "cause": "Passengers need to know the current location and might be curious to see what the road is like from the ZOOX vehicle's view",
          "solution": "Need to switch between Map View and Car View"
        },
        "fourth": {
          "cause": "Music play and in-door environment controls might not be used frequently",
          "solution": "A pull-out page for these functions"
        },
        "fifth": {
          "cause": "Export emergencies",
          "solution": "Lacks time for typing during emergencies, so needs pre-set templates  and options for most likely scenarios"
        },
        "sixth": {
          "cause": "Connect via video",
          "solution": "Might be no video even after connecting or the passenger isn't able to speak, so pre-set templates should be set too"
        }
      }
    },
    "Moodboard": {
      "title": "Moodboard",
      "detail": "Choose Moddboard 2 becuase it is closer too ZOOX official case and more distinguishable with other ride share companies",
      "description1": "Moodboard 1. Light mode design that gives out a smart soft technology feeling as well as elegance with the bright and clean visual design. Mostly uses pastel colors to work as contrast to the background to aid information display.",
      "description2": "Moodboard 2. Dark mode design that gives out a serious futuristic, technological ambiance. High saturation colors are used as contrast to the background to put emphasis on the displayed information."
    },
    "Wireframes": {
      "title": "Wireframes"
    },
    "Prototypes": {
      "title": "Prototypes"
    },
    "Iteration": {
      "title": "Iteration",
      "changes": {
        "title": "Changes: ",
        "description": {
          "text1": "Changed screensaver unlocking mechanism from swiping from right to left to from bottom to top, which is more in line with the motion of unlocking mobile phones or tablets. Removing the arrow also saves left and right spaces. ",
          "text2": "Simplified the information displayed on the screensaver, making it cleaner",
          "text3": "Changed the orientation of the expandable page from horizontal to vertical, making the pull-out animation more concise and intuitive",
          "text4": "Instead of swiping the page sideways to switch between the map and the car's view, one can press the toggle button. Other than requiring a smaller range of motion, it allows the passenger to have a better idea about what the other option is."
        }
      },
      "FinalResult": {
        "title": "Final Result:",
        "detail": "View Prototype in Browser"
      }
    }
  },
  "WhatColor": {
    "HeaderContent": {
      "title": "What Color: an Arduino based color detection toy",
      "detail": "This product encourages 4+ year olds to learn about colors with surrounding objects. After the color is detected by the sensor, its red, yellow and blue composition will be displayed on WhatColor's touchscreen, and the child can then draw with this color. Showing the RGB composition not only can teach children what red, yellow, and blue are, but also color mixing and more advanced color concepts such as coral and cyan for those that already know RGB.",
      "projectType": "Class Project",
      "myRole": "Project Owner",
      "currentStatus": "User testing done",
      "Btn": false,
      "BtnContent": null,
      "IconImage": null
    },
    "Intro": {
      "title": "Introduction",
      "message": "According to CDC, children at the age of 4 should reach the cognitive milestone of being able to name a few colors of items",
      "detail1": "What Color is for 4+ children that are studying the basic colors (red, yellow, blue), or has already learned the basics and learn about color mixing",
      "detail2": "Encourage children to scan object colors and draw with it when exploring",
      "detail3": "Heighten children's sensitivity in different shades and learn about color mixing",
      "detail4": "Composition: color sensors + touch screen + Arduino + 3d printed case",
      "compo": "3D printed shell"
    },
    "InitDesign": {
      "title": "Initial Design Progress",
      "need": {
        "title": "Need analysis: ",
        "message": "4 year olds should be able to name a few colors of items."
      },
      "task": {
        "title": "Task analysis: ",
        "message1": "Found toy with similar concept: magnetic drawing board. Performed task analysis with an online ",
        "message2": "video",
        "message3": " with children interacting and reviewing a board."
      },
      "discovery": {
        "title": "Main takeaways: ",
        "message1": "3 year-old child could lift a 710g item",
        "message2": "pen with a diameter of 1.2cm could be easily utilized by 1 year- old in a grabbing hand position"
      }
    },
    "IteratedDesign": {
      "title": "Iterated Design",
      "summary": {
        "detail1": "Took in consideration of ergonomics to make it portable",
        "detail2": "Handle is placed on the left to not be in the way during drawing, so they could hold the toy and pen to run around at the same time",
        "detail3": "Added touch screen and pen for drawing entertainment",
        "detail4": "Similar to tablets and magnetic drawing board that children are familiar with"
      },
      "FlowChart": "Workflow Chart",
      "thoughts": {
        "detail1": "Then thought about how putting the color sensor on the back of the product fits more closely with people's habit of scnaning objects with our phones or tablets.",
        "detail2": "This change is reflected in 3D modeling."
      },
      "modeling": {
        "title": "3D Modeling",
        "message1": "The 9V battery is placed at the bottom of the product, so the balance point of this device would be more towards the bottom. This make it easier for children to hold and run around with it while avoiding affordance of smashing ",
        "message2": "According to Kong, the optimal handle diameter for grip force tasks is 19.7% of the user's hand length. Therefore, the best diameter for a 4 year-old with hand length of 10 cm would be 1.97 cm",
        "message3": "Made sure shell thickness at any point is at least 1.2 cm"
      }
    },
    "FinalProduct": {
      "title": "Final Product + Usability Testing",
      "summary": {
        "detail1": "The product's name is written at the top of the toy to indicate which orientation this device should be held",
        "detail2": "The device weighs about 300g, which wouldn't cause musculoskeletal injury among young children",
        "detail3": {
          "title": "Conducted usability testing with a 4 year old female and a 8 year old female. To protect their privacy, videos wouldn't be shared.",
          "detail1": "All of the participants took the pen out by poking at its top, rather than using the space at the right-side of the pen.",
          "detail2": "The handle is placed on the left so it wouldn't hinge most child's writing (because right-handedness is the most common), but younger child seems to like grabbing it with their right hand, which could reverse the orientation."
        }
      },
      "FlowChart": "Updated Workflow Chart"
    },
    "FutureWork": {
      "title": "Future Work",
      "summary": {
        "detail1": "This prototype is influenced by the constraint of available hardware, so there are lots of room for improvements based on user feedback",
        "detail2": "Future iterations will only consider industrial level hardwares",
        "detail3": "Possible routes: tablet to hold with two hands, single-hand scanning device, extend upon smart watches for children...",
        "detail4": "Basic on the paper Improving Colour Patterns to Assist People with Colour Vision Deficiency, it could help color-blind children to understand colors and colors of every day objects"
      }
    },
    "References": "References"
  },
  "Jarney": {
    "HeaderContent": {
      "title": "JARney Scheduler Page Redesign",
      "detail": "此产品鼓励4岁+的孩子通过寻找物品来学习颜色。在识别一个物品的颜色后，What Color的触摸屏上会显示此颜色的红黄蓝构成，然后孩子可以用这个颜色进行绘画。显示红黄蓝的构成不仅可以教孩子什么是红色、黄色、蓝色，而且对于已经熟知红黄蓝的孩子，可以教他们颜色混合和更进阶的颜色概念，如珊瑚色、青色。",
      "projectType": "Class Project",
      "myRole": "Project Owner",
      "currentStatus": "User testing done",
      "Btn": false,
      "BtnContent": null,
      "IconImage": null
    }
  },
  "ActivityStatus": {
    "HeaderContent": {
      "title": "Activity Status Study",
      "detail": "",
      "projectType": "Class Project",
      "myRole": "",
      "currentStatus": "",
      "Btn": false,
      "BtnContent": null,
      "IconImage": null
    }
  }
}
